app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def search
    authors = Author.search(params[:q])
    books = Book.search(params[:q])
    reviews = Review.search(params[:q])
---
SELECT "authors".* FROM "authors" WHERE ( LOWER(name) LIKE '%fantacy%'  OR  LOWER(name) LIKE '%book%'  OR  LOWER(author_bio) LIKE '%fantacy%'  OR  LOWER(author_bio) LIKE '%book%'  OR  LOWER(academics) LIKE '%fantacy%'  OR  LOWER(academics) LIKE '%book%'  OR  LOWER(awards) LIKE '%fantacy%'  OR  LOWER(awards) LIKE '%book%' )
SELECT "books".* FROM "books" WHERE ( LOWER(name_of_book) LIKE '%fantasy%'  OR  LOWER(name_of_book) LIKE '%book%'  OR  LOWER(short_description) LIKE '%fantasy%'  OR  LOWER(short_description) LIKE '%book%'  OR  LOWER(long_description) LIKE '%fantasy%'  OR  LOWER(long_description) LIKE '%book%'  OR  'Fantasy' = ANY (genre) )
SELECT "reviews".* FROM "reviews" WHERE ( LOWER(name_of_reviewer) LIKE '%fantacy%'  OR  LOWER(name_of_reviewer) LIKE '%book%'  OR  LOWER(review_title) LIKE '%fantacy%'  OR  LOWER(review_title) LIKE '%book%'  OR  LOWER(review_description) LIKE '%fantacy%'  OR  LOWER(review_description) LIKE '%book%' )

  def find_user
    @user = User.find_by_username!(params[:_username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT $1  [["LIMIT", 1]]